app/views/comments/_form.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", "5"]]
---
<h3>Comments (<%= @post.comments.size %>)</h3>