app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", "2"]]
---
<ul>
  <% @user.posts.each do |post| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<% if logged_in? && current_user == @user.posts.first.user%>