app/views/posts/show.html.erb

<ul>
  <% @post.comments.each do |com| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", "5"]]