app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "is_approved" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["is_approved", "y"], ["updated_at", "2018-07-17 07:35:11.233458"], ["id", 2]]
---
  def edit
    @comment = Comment.find(params[:id])
    @comment.is_approved = "y"

    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

INSERT INTO "comments" ("text", "created_at", "updated_at", "post_id", "user_id", "is_approved") VALUES (?, ?, ?, ?, ?, ?)  [["text", "22"], ["created_at", "2018-07-17 07:28:29.323395"], ["updated_at", "2018-07-17 07:28:29.323395"], ["post_id", "2"], ["user_id", "2"], ["is_approved", "n"]]
---
  def create
    # debugger
    # binding.pry
    # be rails c
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.is_approved = "n"

    if @comment.save