app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%123%') ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "123"], ["body", "123"], ["created_at", "2018-07-16 10:14:29.282414"], ["updated_at", "2018-07-16 10:14:29.282414"], ["user_id", "1"]]
---
  def create
    puts post_params
    @post = Post.new(post_params)
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "112"], ["body", "112"], ["updated_at", "2018-07-16 11:20:26.147383"], ["id", 7]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)