app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # if(user_params.email.uni)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "created_at", "updated_at", "biography") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["last_name", ""], ["email", ""], ["created_at", "2018-07-16 08:17:40.933105"], ["updated_at", "2018-07-16 08:17:40.933105"], ["biography", ""]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "jj-sSap9Bxn9-CJSWwU4"], ["crypted_password", "$2a$10$RCNAV/r8eWQttjVF8An46OROaAB.OXMRT.cb1kaRTSXe5DfWdT7z."], ["updated_at", "2018-07-13 11:41:39.255737"], ["id", 2]]